# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [4]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [5]:
# your code here
orders= pd.read_csv("C:\\Users\\Zoe Mercury\\Documents\\GitHub\\Week 2\\lab-dataframe-calculations\\your-code\\Orders.csv")
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [8]:
# your code here
group1= orders.groupby(by="CustomerID").agg({"amount_spent":sum})

group1

# 1. we need to group the amount_spent by customerId
# 2. bins-->we get number of customers for bins of amount_spent
# 3. create new column with labels for customers

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40
...                  ...
18280             180.60
18281              80.82
18282             178.05
18283            2094.88
18287            1837.28

[4339 rows x 1 columns]

In [28]:
group2= pd.qcut(group1["amount_spent"],4,labels=["Insignificant", "Normal","Preferred", "VIP"])
group2
#to define different size of bins you would have to put bins= or a list instead of 4

CustomerID
12346              VIP
12347              VIP
12348              VIP
12349              VIP
12350           Normal
             ...
18280    Insignificant
18281    Insignificant
18282    Insignificant
18283              VIP
18287              VIP
Name: amount_spent, Length: 4339, dtype: category
Categories (4, object): [Insignificant < Normal < Preferred < VIP]

In [29]:
group2.value_counts()

VIP              1085
Normal           1085
Insignificant    1085
Preferred        1084
Name: amount_spent, dtype: int64

In [30]:
new_orders= pd.merge(orders, group2, how="left", on ="CustomerID")
new_orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent_x,amount_spent_y
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30,VIP
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00,VIP
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34,VIP
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20,Preferred
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60,Preferred
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60,Preferred
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60,Preferred
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85,Preferred

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [24]:
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [58]:
# your code here
# how to analyse bins for country?
countrylist= new_orders.groupby(by=["Country"]).agg({"amount_spent_y": "count"})
countrylist
#counted all the customer

                      amount_spent_y
Country
Australia                       1185
Austria                          398
Bahrain                           17
Belgium                         2031
Brazil                            32
Canada                           151
Channel Islands                  748
Cyprus                           614
Czech Republic                    25
Denmark                          380
EIRE                            7238
European Community                60
Finland                          685
France                          8342
Germany                         9042
Greece                           145
Iceland                          182
Israel                           248
Italy                            758
Japan                            321
Lebanon                           45
Lithuania                         35
Malta                            112
Netherlands                     2363
Norway                          1072
Poland                           330
Portugal                        1462
RSA                               58
Saudi Arabia                       9
Singapore                        222
Spain                           2485
Sweden                           451
Switzerland                     1842
USA                              179
United Arab Emirates              68
United Kingdom                354345
Unspecified                      244

In [59]:
countrylist= new_orders.groupby(by=["Country","amount_spent_y"]).agg({"amount_spent_y": "count"})
countrylist

                               amount_spent_y
Country        amount_spent_y
Australia      Insignificant                0
               Normal                      22
               Preferred                  135
               VIP                       1028
Austria        Insignificant                4
...                                       ...
United Kingdom VIP                     221635
Unspecified    Insignificant                0
               Normal                     188
               Preferred                   56
               VIP                          0

[148 rows x 1 columns]

In [60]:
countrylist.columns= ["Amount Spent"]
countrylist

                               Amount Spent
Country        amount_spent_y
Australia      Insignificant              0
               Normal                    22
               Preferred                135
               VIP                     1028
Austria        Insignificant              4
...                                     ...
United Kingdom VIP                   221635
Unspecified    Insignificant              0
               Normal                   188
               Preferred                 56
               VIP                        0

[148 rows x 1 columns]

In [61]:
countrylist=countrylist.reset_index()

In [62]:
m= countrylist["amount_spent_y"] == "VIP"

countrylist_vip=countrylist[m]
#make a condition, filter by condition

In [63]:
country_vip= countrylist.sort_values ("Amount Spent", ascending=False)

In [64]:
countrylist_vip

                  Country amount_spent_y  Amount Spent
3               Australia            VIP          1028
7                 Austria            VIP           158
11                Bahrain            VIP             0
15                Belgium            VIP          1557
19                 Brazil            VIP             0
23                 Canada            VIP           135
27        Channel Islands            VIP           589
31                 Cyprus            VIP           451
35         Czech Republic            VIP             0
39                Denmark            VIP           217
43                   EIRE            VIP          7238
47     European Community            VIP             0
51                Finland            VIP           504
55                 France            VIP          6301
59                Germany            VIP          7349
63                 Greece            VIP            32
67                Iceland            VIP           182
71                 Israel            VIP           214
75                  Italy            VIP           507
79                  Japan            VIP           272
83                Lebanon            VIP            45
87              Lithuania            VIP             0
91                  Malta            VIP            67
95            Netherlands            VIP          2080
99                 Norway            VIP          1028
103                Poland            VIP           149
107              Portugal            VIP          1093
111                   RSA            VIP             0
115          Saudi Arabia            VIP             0
119             Singapore            VIP           222
123                 Spain            VIP          1569
127                Sweden            VIP           273
131           Switzerland            VIP          1370
135                   USA            VIP             0
139  United Arab Emirates            VIP             0
143        United Kingdom            VIP        221635
147           Unspecified            VIP             0

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [68]:
# your code here
m= (countrylist["amount_spent_y"] == "VIP") | (countrylist["amount_spent_y"] == "Preferred")

countrylist2=countrylist[m]

In [69]:
countrylist2

                  Country amount_spent_y  Amount Spent
2               Australia      Preferred           135
3               Australia            VIP          1028
6                 Austria      Preferred           204
7                 Austria            VIP           158
10                Bahrain      Preferred             0
..                    ...            ...           ...
139  United Arab Emirates            VIP             0
142        United Kingdom      Preferred         77410
143        United Kingdom            VIP        221635
146           Unspecified      Preferred            56
147           Unspecified            VIP             0

[74 rows x 3 columns]

In [72]:
new_country=countrylist2.groupby(by=["Country"]).agg({"Amount Spent": sum})
new_country

                      Amount Spent
Country
Australia                     1163
Austria                        362
Bahrain                          0
Belgium                       1921
Brazil                          32
Canada                         135
Channel Islands                731
Cyprus                         451
Czech Republic                  25
Denmark                        336
EIRE                          7238
European Community              60
Finland                        568
France                        7413
Germany                       8275
Greece                         123
Iceland                        182
Israel                         214
Italy                          650
Japan                          284
Lebanon                         45
Lithuania                       35
Malta                          112
Netherlands                   2291
Norway                        1028
Poland                         284
Portugal                      1229
RSA                             58
Saudi Arabia                     0
Singapore                      222
Spain                         2228
Sweden                         359
Switzerland                   1751
USA                            146
United Arab Emirates            68
United Kingdom              299045
Unspecified                     56

In [73]:
new_country= new_country.sort_values ("Amount Spent", ascending=False)

In [74]:
new_country

                      Amount Spent
Country
United Kingdom              299045
Germany                       8275
France                        7413
EIRE                          7238
Netherlands                   2291
Spain                         2228
Belgium                       1921
Switzerland                   1751
Portugal                      1229
Australia                     1163
Norway                        1028
Channel Islands                731
Italy                          650
Finland                        568
Cyprus                         451
Austria                        362
Sweden                         359
Denmark                        336
Japan                          284
Poland                         284
Singapore                      222
Israel                         214
Iceland                        182
USA                            146
Canada                         135
Greece                         123
Malta                          112
United Arab Emirates            68
European Community              60
RSA                             58
Unspecified                     56
Lebanon                         45
Lithuania                       35
Brazil                          32
Czech Republic                  25
Bahrain                          0
Saudi Arabia                     0